jankaluza/qsimkit/GUI/MCU/MSP430/CPU/Variants/msp430xG461x.cpp
#endif
#ifndef VLCD2
#define VLCD2 0x08
#endif
#ifndef VLCD3
#define VLCD3 0x10
#endif
#ifndef __SIZEOF_LONG_LONG__
#define __SIZEOF_LONG_LONG__ 8
#endif
#ifndef UCA0TXBUF_
#define UCA0TXBUF_ 0x0067
#endif
#ifndef FN_2
#define FN_2 0x04
#endif
#ifndef FN_3
#define FN_3 0x08
#endif
#ifndef FN_4
#define FN_4 0x10
#endif
#ifndef FN_8
#define FN_8 0x20
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef __LDBL_DIG__
#define __LDBL_DIG__ 6
#endif
#ifndef P9SEL_
#define P9SEL_ 0x000E
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef ENNMI
#define ENNMI 0x0001
#endif
#ifndef __GNUC_GNU_INLINE__
#define __GNUC_GNU_INLINE__ 1
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2
#endif
#ifndef BTIP0
#define BTIP0 0x01
#endif
#ifndef BTIP1
#define BTIP1 0x02
#endif
#ifndef BTIP2
#define BTIP2 0x04
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef INCH_A4
#define INCH_A4 4
#endif
#ifndef DMA2SAL_
#define DMA2SAL_ 0x01EA
#endif
#ifndef BRK
#define BRK 0x10
#endif
#ifndef CAPD0
#define CAPD0 0x01
#endif
#ifndef CAPD1
#define CAPD1 0x02
#endif
#ifndef CAPD2
#define CAPD2 0x04
#endif
#ifndef CAPD3
#define CAPD3 0x08
#endif
#ifndef CAPD4
#define CAPD4 0x10
#endif
#ifndef CAPD5
#define CAPD5 0x20
#endif
#ifndef CAPD6
#define CAPD6 0x40
#endif
#ifndef CAPD7
#define CAPD7 0x80
#endif
#ifndef INCH_A7
#define INCH_A7 7
#endif
#ifndef DMAIFG
#define DMAIFG 0x0008
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef SHT1_DIV8
#define SHT1_DIV8 SHT1_1
#endif
#ifndef CAPD_
#define CAPD_ 0x005B
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef DAC12OPS
#define DAC12OPS 0x8000
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430xG461x : public Variant {
	public:
		Variant_msp430xG461x() {}
		virtual ~Variant_msp430xG461x() {}
		const char *getName() { return "msp430xG461x"; }

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


		unsigned int getP1IES() {
#ifdef P1IES_
			return P1IES_;
#else
			return 0;
#endif
		}


		unsigned int getP1IFG() {
#ifdef P1IFG_
			return P1IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP1IN() {
#ifdef P1IN_
			return P1IN_;
#else
			return 0;
#endif
		}


		unsigned int getP1OUT() {
#ifdef P1OUT_
			return P1OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP1REN() {
#ifdef P1REN_
			return P1REN_;
#else
			return 0;
#endif
		}


		unsigned int getP1SEL() {
#ifdef P1SEL_
			return P1SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP2DIR() {
#ifdef P2DIR_
			return P2DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP2IE() {
#ifdef P2IE_
			return P2IE_;
#else
			return 0;
#endif
		}


		unsigned int getP2IES() {
#ifdef P2IES_
			return P2IES_;
#else
			return 0;
#endif
		}


		unsigned int getP2IFG() {
#ifdef P2IFG_
			return P2IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP2IN() {
#ifdef P2IN_
			return P2IN_;
#else
			return 0;
#endif
		}


		unsigned int getP2OUT() {
#ifdef P2OUT_
			return P2OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP2REN() {
#ifdef P2REN_
			return P2REN_;
#else
			return 0;
#endif
		}


		unsigned int getP2SEL() {
#ifdef P2SEL_
			return P2SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP3DIR() {
#ifdef P3DIR_
			return P3DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP3IN() {
#ifdef P3IN_
			return P3IN_;
#else
			return 0;
#endif
		}


		unsigned int getP3OUT() {
#ifdef P3OUT_
			return P3OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP3REN() {
#ifdef P3REN_
			return P3REN_;
#else
			return 0;
#endif
		}


		unsigned int getP3SEL() {
#ifdef P3SEL_
			return P3SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP4DIR() {
#ifdef P4DIR_
			return P4DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP4IN() {
#ifdef P4IN_
			return P4IN_;
#else
			return 0;
#endif
		}


		unsigned int getP4OUT() {
#ifdef P4OUT_
			return P4OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP4REN() {
#ifdef P4REN_
			return P4REN_;
#else
			return 0;
#endif
		}


		unsigned int getP4SEL() {
#ifdef P4SEL_
			return P4SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP5DIR() {
#ifdef P5DIR_
			return P5DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP5IN() {
#ifdef P5IN_
			return P5IN_;
#else
			return 0;
#endif
		}


		unsigned int getP5OUT() {
#ifdef P5OUT_
			return P5OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP5REN() {
#ifdef P5REN_
			return P5REN_;
#else
			return 0;
#endif
		}


		unsigned int getP5SEL() {
#ifdef P5SEL_
			return P5SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP6DIR() {
#ifdef P6DIR_
			return P6DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP6IN() {
#ifdef P6IN_
			return P6IN_;
#else
			return 0;
#endif
		}


		unsigned int getP6OUT() {
#ifdef P6OUT_
			return P6OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP6REN() {
#ifdef P6REN_
			return P6REN_;
#else
			return 0;
#endif
		}


		unsigned int getP6SEL() {
#ifdef P6SEL_
			return P6SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP7DIR() {
#ifdef P7DIR_
			return P7DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP7IN() {
#ifdef P7IN_
			return P7IN_;
#else
			return 0;
#endif
		}


		unsigned int getP7OUT() {
#ifdef P7OUT_
			return P7OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP7REN() {
#ifdef P7REN_
			return P7REN_;
#else
			return 0;
#endif
		}


		unsigned int getP7SEL() {
#ifdef P7SEL_
			return P7SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP8DIR() {
#ifdef P8DIR_
			return P8DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP8IN() {
#ifdef P8IN_
			return P8IN_;
#else
			return 0;
#endif
		}


		unsigned int getP8OUT() {
#ifdef P8OUT_
			return P8OUT_;
#else
			return 0;
#endif
		}


