jankaluza/qsimkit/GUI/MCU/MSP430/CPU/Variants/msp430xG461x.cpp
		unsigned int getP8REN() {
#ifdef P8REN_
			return P8REN_;
#else
			return 0;
#endif
		}


		unsigned int getP8SEL() {
#ifdef P8SEL_
			return P8SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP9DIR() {
#ifdef P9DIR_
			return P9DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP9IN() {
#ifdef P9IN_
			return P9IN_;
#else
			return 0;
#endif
		}


		unsigned int getP9OUT() {
#ifdef P9OUT_
			return P9OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP9REN() {
#ifdef P9REN_
			return P9REN_;
#else
			return 0;
#endif
		}


		unsigned int getP9SEL() {
#ifdef P9SEL_
			return P9SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP10DIR() {
#ifdef P10DIR_
			return P10DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP10IN() {
#ifdef P10IN_
			return P10IN_;
#else
			return 0;
#endif
		}


		unsigned int getP10OUT() {
#ifdef P10OUT_
			return P10OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP10REN() {
#ifdef P10REN_
			return P10REN_;
#else
			return 0;
#endif
		}


		unsigned int getP10SEL() {
#ifdef P10SEL_
			return P10SEL_;
#else
			return 0;
#endif
		}


		unsigned int getPORT1_VECTOR() {
#ifdef PORT1_VECTOR
			return PORT1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getPORT2_VECTOR() {
#ifdef PORT2_VECTOR
			return PORT2_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getDCOCTL() {
#ifdef DCOCTL_
			return DCOCTL_;
#else
			return 0;
#endif
		}


		unsigned int getBCSCTL1() {
#ifdef BCSCTL1_
			return BCSCTL1_;
#else
			return 0;
#endif
		}


		unsigned int getBCSCTL2() {
#ifdef BCSCTL2_
			return BCSCTL2_;
#else
			return 0;
#endif
		}


		unsigned int getBCSCTL3() {
#ifdef BCSCTL3_
			return BCSCTL3_;
#else
			return 0;
#endif
		}


		unsigned int getTA0R() {
#ifdef TA0R_
			return TA0R_;
#else
			return 0;
#endif
		}


		unsigned int getTA1R() {
#ifdef TA1R_
			return TA1R_;
#else
			return 0;
#endif
		}


		unsigned int getTACCR0() {
#ifdef TACCR0_
			return TACCR0_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CTL() {
#ifdef TA0CTL_
			return TA0CTL_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CTL() {
#ifdef TA1CTL_
			return TA1CTL_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCR0() {
#ifdef TA0CCR0_
			return TA0CCR0_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCR1() {
#ifdef TA0CCR1_
			return TA0CCR1_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCR2() {
#ifdef TA0CCR2_
			return TA0CCR2_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCR3() {
#ifdef TA0CCR3_
			return TA0CCR3_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCR4() {
#ifdef TA0CCR4_
			return TA0CCR4_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCR0() {
#ifdef TA1CCR0_
			return TA1CCR0_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCR1() {
#ifdef TA1CCR1_
			return TA1CCR1_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCR2() {
#ifdef TA1CCR2_
			return TA1CCR2_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCR3() {
#ifdef TA1CCR3_
			return TA1CCR3_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCR4() {
#ifdef TA1CCR4_
			return TA1CCR4_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCTL0() {
#ifdef TA0CCTL0_
			return TA0CCTL0_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCTL1() {
#ifdef TA0CCTL1_
			return TA0CCTL1_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCTL2() {
#ifdef TA0CCTL2_
			return TA0CCTL2_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCTL3() {
#ifdef TA0CCTL3_
			return TA0CCTL3_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCTL4() {
#ifdef TA0CCTL4_
			return TA0CCTL4_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL0() {
#ifdef TA1CCTL0_
			return TA1CCTL0_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL1() {
#ifdef TA1CCTL1_
			return TA1CCTL1_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL2() {
#ifdef TA1CCTL2_
			return TA1CCTL2_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL3() {
#ifdef TA1CCTL3_
			return TA1CCTL3_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL4() {
#ifdef TA1CCTL4_
			return TA1CCTL4_;
#else
			return 0;
#endif
		}


		unsigned int getTA0IV() {
#ifdef TA0IV_
			return TA0IV_;
#else
			return 0;
#endif
		}


		unsigned int getTA1IV() {
#ifdef TA1IV_
			return TA1IV_;
#else
			return 0;
#endif
		}


		unsigned int getTIMERA0_VECTOR() {
#ifdef TIMERA0_VECTOR
			return TIMERA0_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMERA1_VECTOR() {
#ifdef TIMERA1_VECTOR
			return TIMERA1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMER0_A0_VECTOR() {
#ifdef TIMER0_A0_VECTOR
			return TIMER0_A0_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMER0_A1_VECTOR() {
#ifdef TIMER0_A1_VECTOR
			return TIMER0_A1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMER1_A0_VECTOR() {
#ifdef TIMER1_A0_VECTOR
			return TIMER1_A0_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMER1_A1_VECTOR() {
#ifdef TIMER1_A1_VECTOR
			return TIMER1_A1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTBR() {
#ifdef TBR_
			return TBR_;
#else
			return 0;
#endif
		}


		unsigned int getTBCTL() {
#ifdef TBCTL_
			return TBCTL_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR0() {
#ifdef TBCCR0_
			return TBCCR0_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR1() {
#ifdef TBCCR1_
			return TBCCR1_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR2() {
#ifdef TBCCR2_
			return TBCCR2_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR3() {
#ifdef TBCCR3_
			return TBCCR3_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR4() {
#ifdef TBCCR4_
			return TBCCR4_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR5() {
#ifdef TBCCR5_
			return TBCCR5_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCR6() {
#ifdef TBCCR6_
			return TBCCR6_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL0() {
#ifdef TBCCTL0_
			return TBCCTL0_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL1() {
#ifdef TBCCTL1_
			return TBCCTL1_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL2() {
#ifdef TBCCTL2_
			return TBCCTL2_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL3() {
#ifdef TBCCTL3_
			return TBCCTL3_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL4() {
#ifdef TBCCTL4_
			return TBCCTL4_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL5() {
#ifdef TBCCTL5_
			return TBCCTL5_;
#else
			return 0;
#endif
		}


		unsigned int getTBCCTL6() {
#ifdef TBCCTL6_
			return TBCCTL6_;
#else
			return 0;
#endif
		}


		unsigned int getTBIV() {
#ifdef TBIV_
			return TBIV_;
#else
			return 0;
#endif
		}


		unsigned int getTIMERB0_VECTOR() {
#ifdef TIMERB0_VECTOR
			return TIMERB0_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMERB1_VECTOR() {
#ifdef TIMERB1_VECTOR
			return TIMERB1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getINTVECT() {
#ifdef INTVECT
			return INTVECT;
#else
			return 0;
#endif
		}


		unsigned int getUSISR() {
#ifdef USISR_
			return USISR_;
#else
			return 0;
#endif
		}


		unsigned int getUSICTL() {
#ifdef USICTL_
			return USICTL_;
#else
			return 0;
#endif
		}


		unsigned int getUSICCTL() {
#ifdef USICCTL_
			return USICCTL_;
#else
			return 0;
#endif
		}


		double getSRSEL() {
#ifdef SRSEL
			return SRSEL;
#else
			return 0;
#endif
		}


		double getSDCO() {
#ifdef SDCO
			return SDCO;
#else
			return 0;
#endif
		}


		double getDCOZERO() {
#ifdef DCOZERO
			return DCOZERO;
#else
			return 0;
#endif
		}


};

MSP430_VARIANT("msp430xG461x", msp430xG461x);

